; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v8 - type_2 ?v4 - type_3)
 	      (pred_1 ?v2 - object ?v4 - type_3)
	      (pred_3 ?v8 - type_2 ?v5 - type_1)
	      (pred_4 ?v8 - type_2 ?v2 - object ?v5 - type_1))

   (:action op_1
       :parameters  (?v8 - type_2 ?v6 ?v1 - type_3)
       :precondition (and  (pred_2 ?v8 ?v6))
       :effect (and  (pred_2 ?v8 ?v1)
		     (not (pred_2 ?v8 ?v6))))

   (:action op_3
       :parameters (?v8 - type_2 ?v7 - object ?v3 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_1 ?v7 ?v3) (pred_2 ?v8 ?v3) (pred_3 ?v8 ?v5))
       :effect (and (pred_4 ?v8 ?v7 ?v5)
		    (not (pred_1 ?v7 ?v3)) 
		    (not (pred_3 ?v8 ?v5))))

   (:action op_2
       :parameters (?v8 - type_2 ?v7 - object ?v3 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_4 ?v8 ?v7 ?v5) (pred_2 ?v8 ?v3))
       :effect (and (pred_1 ?v7 ?v3)
		    (pred_3 ?v8 ?v5)
		    (not (pred_4 ?v8 ?v7 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_08 obj_06 - type_2
obj_03 obj_13 obj_12 obj_04 - type_1
obj_09 obj_01 obj_05 obj_02 - type_3
obj_07 obj_10 obj_11 obj_14 - object)
(:init
(pred_2 obj_08 obj_09)
(pred_3 obj_08 obj_03)
(pred_3 obj_08 obj_13)
(pred_2 obj_06 obj_01)
(pred_3 obj_06 obj_12)
(pred_3 obj_06 obj_04)
(pred_1 obj_07 obj_09)
(pred_1 obj_10 obj_01)
(pred_1 obj_11 obj_02)
(pred_1 obj_14 obj_02)
)
(:goal
(and
(pred_1 obj_07 obj_05)
(pred_1 obj_10 obj_02)
(pred_1 obj_11 obj_05)
(pred_1 obj_14 obj_05)
)
)

(:constraints
  (always (not (pred_2 obj_08 obj_05)))
)
)

; plan
1. (op_3 obj_08 obj_07 obj_09 obj_13)
   deleted: (pred_1 obj_07 obj_09) (pred_3 obj_08 obj_13)
   added: (pred_4 obj_08 obj_07 obj_13)
   goals met: 0 of 4
2. (op_3 obj_06 obj_10 obj_01 obj_04)
   deleted: (pred_1 obj_10 obj_01) (pred_3 obj_06 obj_04)
   added: (pred_4 obj_06 obj_10 obj_04)
   goals met: 0 of 4
3. (op_1 obj_06 obj_01 obj_02)
   deleted: (pred_2 obj_06 obj_01)
   added: (pred_2 obj_06 obj_02)
   goals met: 0 of 4
4. (op_1 obj_08 obj_09 obj_02)
   deleted: (pred_2 obj_08 obj_09)
   added: (pred_2 obj_08 obj_02)
   goals met: 0 of 4
5. (op_2 obj_06 obj_10 obj_02 obj_04)
   deleted: (pred_4 obj_06 obj_10 obj_04)
   added: (pred_1 obj_10 obj_02) (pred_3 obj_06 obj_04)
   goals met: 1 of 4
6. (op_3 obj_08 obj_14 obj_02 obj_03)
   deleted: (pred_1 obj_14 obj_02) (pred_3 obj_08 obj_03)
   added: (pred_4 obj_08 obj_14 obj_03)
   goals met: 1 of 4
7. (op_3 obj_06 obj_11 obj_02 obj_12)
   deleted: (pred_1 obj_11 obj_02) (pred_3 obj_06 obj_12)
   added: (pred_4 obj_06 obj_11 obj_12)
   goals met: 1 of 4
8. (op_1 obj_06 obj_02 obj_05)
   deleted: (pred_2 obj_06 obj_02)
   added: (pred_2 obj_06 obj_05)
   goals met: 1 of 4
9. (op_2 obj_08 obj_14 obj_02 obj_03)
   deleted: (pred_4 obj_08 obj_14 obj_03)
   added: (pred_1 obj_14 obj_02) (pred_3 obj_08 obj_03)
   goals met: 1 of 4
10. (op_2 obj_06 obj_11 obj_05 obj_12)
   deleted: (pred_4 obj_06 obj_11 obj_12)
   added: (pred_1 obj_11 obj_05) (pred_3 obj_06 obj_12)
   goals met: 2 of 4
11. (op_1 obj_06 obj_05 obj_02)
   deleted: (pred_2 obj_06 obj_05)
   added: (pred_2 obj_06 obj_02)
   goals met: 2 of 4
12. (op_2 obj_08 obj_07 obj_02 obj_13)
   deleted: (pred_4 obj_08 obj_07 obj_13)
   added: (pred_1 obj_07 obj_02) (pred_3 obj_08 obj_13)
   goals met: 2 of 4
13. (op_3 obj_06 obj_07 obj_02 obj_04)
   deleted: (pred_1 obj_07 obj_02) (pred_3 obj_06 obj_04)
   added: (pred_4 obj_06 obj_07 obj_04)
   goals met: 2 of 4
14. (op_1 obj_06 obj_02 obj_05)
   deleted: (pred_2 obj_06 obj_02)
   added: (pred_2 obj_06 obj_05)
   goals met: 2 of 4
15. (op_2 obj_06 obj_07 obj_05 obj_04)
   deleted: (pred_4 obj_06 obj_07 obj_04)
   added: (pred_1 obj_07 obj_05) (pred_3 obj_06 obj_04)
   goals met: 3 of 4
16. (op_1 obj_06 obj_05 obj_02)
   deleted: (pred_2 obj_06 obj_05)
   added: (pred_2 obj_06 obj_02)
   goals met: 3 of 4
17. (op_3 obj_06 obj_14 obj_02 obj_04)
   deleted: (pred_1 obj_14 obj_02) (pred_3 obj_06 obj_04)
   added: (pred_4 obj_06 obj_14 obj_04)
   goals met: 3 of 4
18. (op_1 obj_06 obj_02 obj_05)
   deleted: (pred_2 obj_06 obj_02)
   added: (pred_2 obj_06 obj_05)
   goals met: 3 of 4
19. (op_2 obj_06 obj_14 obj_05 obj_04)
   deleted: (pred_4 obj_06 obj_14 obj_04)
   added: (pred_1 obj_14 obj_05) (pred_3 obj_06 obj_04)
   goals met: 4 of 4
